import pandas as pd

# Определение уникальных столбцов
columns = [
    "ЭМИТЕНТ",  # или КОМПАНИЯ
    "ТИКЕР",  # или ТИКЕР, МОСБИРЖА
    "РЕЙТИНГ",
    "ЦЕЛЕВАЯ ЦЕНА, РУБ.",
    "ЗАКРЫТИЯ РУБ.",
    "ПОТЕНЦИАЛ РОСТА",
    "РЫНОЧНАЯ КАПИТАЛИЗАЦИЯ, МЛРД РУБ.",
    "МАКСИМУМ ЗА 52 НЕДЕЛИ",
    "МИНИМУМ ЗА 52 НЕДЕЛИ",
    "ОБЪЕМ ТОРГОВЛИ, МЛРД РУБ.",
    "АДТ 3М МЛН РУБ.",
    "1Д",
    "1Н",
    "СНГ",
    "РЕКОМЕНДАЦИЯ",
    "ЦЕЛЕВАЯ ЦЕНА",
    "Потенц.",
    "Код",
    "Капитализация, млрд руб.",
    "ADT, млн руб.",
    "Цена",
    "Рекомендация",
    "P/E 2023П",
    "P/E 2024П",
    "P/E 2025П",
    "EV/REVENUE 2023П",
    "EV/REVENUE 2024П",
    "EV/REVENUE 2025П",
    "EV/EBITDA 2023П",
    "EV/EBITDA 2024П",
    "EV/EBITDA 2025П",
    "EV/S 2023П",
    "EV/S 2024П",
    "EV/S 2025П",
    "ДИВИДЕНДНАЯ ДОХОДНОСТЬ 2023П",
    "ДИВИДЕНДНАЯ ДОХОДНОСТЬ 2024П",
    "ДИВИДЕНДНАЯ ДОХОДНОСТЬ 2025П",
    "data_vendor"  # Добавляемый столбец
]

# Создание пустого датафрейма с этими столбцами
df = pd.DataFrame(columns=columns)

print(df)
